{
  "name": "Vinícius Frazão Barbosa",
  "photo": "https://avatars.githubusercontent.com/u/81500049?s=400&u=f8d570093edd2c9325710444617b6bf0c10a1eea&v=4",
  "job": "Desenvolvedor Front-End Júnior",
  "location": "Bragança Paulista - SP",
  "phone": "https://wa.me/5511941548016",
  "email": "frazaovine@gmail.com",
  "linkedin":"https://linkedin.com/in/vinícius-frazão-3b6804181",
  "git":"https://github.com/VineFrazao?tab=repositories",
  "sobreMim": "Sou um profissional dinâmico e comunicativo, com forte interesse e conhecimento em tecnologia. Tenho facilidade em me adaptar a diferentes ambientes de trabalho e equipes, o que me permitiu adquirir experiência em diversos contextos profissionais.\n Possuo grande empatia, e sou comprometido com o trabalho em equipe, sempre disposto a colaborar e apoiar colegas na busca por soluções eficazes. Minha dedicação é uma característica fundamental que me acompanham em todas as minhas atividades profissionais.",
  "skills": {
    "hardSkills": [
      {
        "name": "HTML",
        "logo": "https://raw.githubusercontent.com/VineFrazao/portfolioVini/main/data/imgs/html.png"
      },
      {
        "name": "CSS",
        "logo": "https://raw.githubusercontent.com/VineFrazao/portfolioVini/main/data/imgs/css.png"
      },
      {
        "name": "JavaScript",
        "logo": "https://raw.githubusercontent.com/VineFrazao/portfolioVini/main/data/imgs/js.png"
      },
      {
        "name": "PHP",
        "logo": "https://raw.githubusercontent.com/VineFrazao/portfolioVini/main/data/imgs/php.png"
      },
      {
        "name": "SQL",
        "logo": "https://raw.githubusercontent.com/VineFrazao/portfolioVini/main/data/imgs/mysql.png"
      }
    ],
    "softSkills": [
      "Empatia",
      "Comunicação",
      "Trabalho em equipe",
      "Flexibilidade",
      "Organização",
      "Qualidade de entrega"
    ]
  },
   "professionalExperience": [
    {
      "name": "Desenvolvedor junior / Dynamic Air",
      "period": "Outubro 2022 - Atual",
      "description": "Atuo na programação, manutenção e atualização de sites low-code para clientes que contratam serviços de coleta de dados e desejam acessá-los de forma online e personalizada. Além disso, sou responsável pela construção, manutenção e atualização de sites internos que fornecem acesso a informações importantes sobre a manutenção de equipamentos e o uso dos mesmos. Também trabalho em projetos de melhorias nos sistemas de apontamento de horas e na criação de bases de conhecimento.\n Atuo como responsável pela instalação, configuração, manutenção e monitoramento do Zabbix para o monitoramento interno da rede. Além disso, ofereço suporte à equipe de TI sempre que solicitado, contribuindo para a resolução de problemas e a otimização dos processos de rede."
    },
    {
      "name": "Montagem de paineis elétricos / Dynamic Air",
      "period": "Outubro 2021 - Outubro 2022",
      "description": "Atuei como montador de painéis de controle para sistemas de transporte, além de painéis pneumáticos, realizando testes completos dos mesmos com ligação elétrica e pneumática. Minha experiência inclui:\n\n Montagem de Painéis de Controle: Montagem de painéis de controle complexos para sistemas de transporte, garantindo que cada componente seja instalado corretamente e de acordo com as especificações técnicas.\n\n Painéis Pneumáticos: Especialista na montagem de painéis pneumáticos, assegurando a precisão e eficiência no funcionamento dos sistemas.\n\n Testes Elétricos e Pneumáticos: Realização de testes rigorosos para verificar o funcionamento correto dos painéis, tanto nas conexões elétricas quanto pneumáticas, assegurando a qualidade e segurança dos produtos finais.\n\n Diagnóstico e Solução de Problemas: Experiência em identificar e resolver problemas durante o processo de montagem e teste, garantindo que todos os sistemas operem de maneira eficaz."
    },
    {
      "name": "Auxiliar de Ti - Estagio / Escola Municipal Prof. Fernando Amos Siriani",
      "period": "Outubro 2019 - Dezembro 2020",
      "description": "Atuei na manutenção e atualização dos equipamentos de informática, garantindo seu pleno funcionamento e segurança. Além disso, ofereci suporte técnico aos professores e secretários para otimizar o uso das ferramentas tecnológicas, incluindo:\n\n Manutenção de Equipamentos: Realizei a manutenção preventiva e corretiva dos equipamentos das salas de informática, assegurando que estivessem sempre atualizados e protegidos contra ameaças de segurança.\n\n Suporte aos Professores: Auxiliei os professores no uso dos equipamentos durante as aulas de informática, proporcionando soluções rápidas para problemas técnicos e assegurando uma experiência de ensino eficaz.\n\n Assistência Administrativa: Ofereci suporte aos secretários com minha expertise em Microsoft Office, ajudando na elaboração de documentos, planilhas, e apresentações, e melhorando a eficiência das operações administrativas.\n\n Gerenciamento de Software: Assegurei que todo o software necessário estivesse instalado, atualizado e em conformidade com as políticas de TI da instituição."
    }
  ],
  "portfolio": [
    {
      "name": "Desafio JavaScript IF",
      "url": "https://github.com/VineFrazao/primeiro-desafio-felipao/tree/main",
      "github": true
    },
    {
      "name": "Classe e Switch JavaScript",
      "url": "https://github.com/VineFrazao/desafio-tipo-heroi/tree/main",
      "github": true
    },
    {
      "name": "Desafio Função JavaScript",
      "url": "https://github.com/VineFrazao/desafio-calculadora-ranking/tree/main",
      "github": true
    },
    {
      "name": "Desafio Requisição de API Pokemons",
      "url": "https://github.com/VineFrazao/pokedex-dio-detalhes",
      "github": true
    },
    {
      "name": "Lendo e usando os dados recebidos de API",
      "url": "https://github.com/VineFrazao/cotacao-Api",
      "github": true
    },
    {
      "name": "Procurar repositório via API GIT + REACT",
      "url": "https://github.com/VineFrazao/git-repo",
      "github": true
    }
  ]
}
